Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/COMPONENT_WPS/cy_wps.c
/*
 * Copyright 2020, Cypress Semiconductor Corporation or a subsidiary of
 * Cypress Semiconductor Corporation. All Rights Reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software"), is owned by Cypress Semiconductor Corporation
 * or one of its subsidiaries ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products. Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
 */

/**
* @file cy_wps.c
* @brief Cypress WPS implementation
*/

/******************************************************
 *            Includes
 ******************************************************/

#include "cy_wps.h"

#include "cy_eapol.h"
#include "cy_wps_common.h"
#include "cy_wps_constants.h"
#include "cy_wps_structures.h"
#include "string.h"
#include "stdlib.h"
#include "cy_wcm_log.h"
#include "whd_wifi_api.h"
#include "cy_wps_memory.h"
#include "whd_types_int.h"
#include "whd_events_int.h"
#include "whd_network_types.h"
#include "whd_cdc_bdc.h"
#include "whd_buffer_api.h"
#include "whd_int.h"
#include "whd_debug.h"
#include "cy_lwip.h"

/******************************************************
 *             Constants
 ******************************************************/

#define EAPOL_HEADER_SPACE                (sizeof(ether_header_t) + sizeof(eapol_header_t))
#define WL_CHANSPEC_CHAN_MASK             0x00ff
#define WL_CHANSPEC_BAND_2G               0x2000
#define WPS_THREAD_STACK_SIZE             (4*1024)
#define AUTHORIZED_MAC_LIST_LENGTH        (1)
#define ACTIVE_WPS_WORKSPACE_ARRAY_SIZE   (1)

#define DOT11_IE_ID_VENDOR_SPECIFIC       ( 221 )
#define KDK_REQUIRED_CRYPTO_MATERIAL      (CY_WPS_CRYPTO_MATERIAL_ENROLLEE_NONCE | CY_WPS_CRYPTO_MATERIAL_REGISTRAR_NONCE | CY_WPS_CRYPTO_MATERIAL_ENROLLEE_MAC_ADDRESS)

/* Time related constants */
#define SECONDS                      (1000)
#define MINUTES                      (60 * SECONDS)
#define WPS_TOTAL_MAX_TIME           (120*1000)  /* In milliseconds */
#define DUAL_BAND_WPS_SCAN_TIMEOUT   (5000)      /* In milliseconds */
#define SINGLE_BAND_WPS_SCAN_TIMEOUT (2500)      /* In milliseconds. 4390 takes longest time to complete scan. */
#define DEFAULT_WPS_JOIN_TIMEOUT     (1500)
#define WPS_PBC_OVERLAP_WINDOW       (120*1000) /* In milliseconds */

/******************************************************
 *             Macros
 ******************************************************/

#define IF_TO_WORKSPACE( interface )   ( active_wps_workspaces[0] )     /* STA = 0,  AP = 1 */

/******************************************************
 *             Local Structures
 ******************************************************/

typedef struct
{
    cy_host_workspace_t host_workspace;

    union
    {
        struct
        {
            cy_wps_credential_t*     enrollee_output;
            uint16_t*                enrollee_output_length;
            uint16_t                 stored_credential_count;
            cy_wps_ap_t              ap_list[AP_LIST_SIZE];
            uint8_t                  ap_list_counter;
            cy_wps_scan_handler_t    scan_handler_ptr;
        } enrollee;
        struct
        {
            const cy_wps_credential_t* ap_details;
            whd_mac_t                  authorized_mac_list[AUTHORIZED_MAC_LIST_LENGTH];
        } registrar;
    } stuff;
} cy_wps_workspace_t;

typedef struct
{
    cy_time_t     probe_request_rx_time;
    whd_mac_t     probe_request_mac;
} cy_wps_pbc_overlap_record_t;

typedef void (*cy_wps_pbc_probreq_notify_callback_t)(whd_mac_t mac);

/******************************************************
 *             Static Variables
 ******************************************************/
static whd_scan_result_t scan_result;

/* Active WPS workspaces.
 * Need to have one for each interface, but for now as only STA is supported. added only one */
static cy_wps_agent_t* active_wps_workspaces[ACTIVE_WPS_WORKSPACE_ARRAY_SIZE] = {0};

static       cy_wps_pbc_overlap_record_t pbc_overlap_array[2] = { { 0 } };
static       cy_wps_pbc_overlap_record_t last_pbc_enrollee    = { 0 };
static const whd_event_num_t          wps_events[]         = { WLC_E_PROBREQ_MSG, WLC_E_NONE };
const        uint32_t wps_m2_timeout                       = WPS_PUBLIC_KEY_MESSAGE_TIMEOUT;

static       cy_wps_pbc_probreq_notify_callback_t pbc_probreq_notify_callback;

/******************************************************
 *             Static Function Prototypes
 ******************************************************/

static void           cy_wps_thread                    ( cy_thread_arg_t arg );
static void           cy_wps_whd_scan_result_handler   ( whd_scan_result_t** result_ptr, void* user_data, whd_scan_status_t status );
static void*          cy_wps_softap_event_handler      ( whd_interface_t interface, const whd_event_header_t* event_header, const uint8_t* event_data, /*@returned@*/ void* handler_user_data );
static cy_rslt_t      cy_wps_internal_pbc_overlap_check( const whd_mac_t* mac );
static void           cy_network_process_wps_eapol_data( /*@only@*/ whd_buffer_t buffer, whd_interface_t interface );
static tlv8_header_t* cy_wps_parse_dot11_tlvs          ( const tlv8_header_t* tlv_buf, uint32_t buflen, dot11_ie_id_t key );

/******************************************************
 *             Function definitions
 ******************************************************/

cy_rslt_t cy_wps_init(cy_wps_agent_t* workspace, const cy_wps_device_detail_t* details, cy_wps_agent_type_t type, whd_interface_t interface )
{
    cy_wps_workspace_t* host_workspace;
    cy_rslt_t result;

