Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/COMPONENT_WPS/cy_wps.c
cy_rslt_t cy_wps_internal_init( cy_wps_agent_t* workspace, uint32_t interface, cy_wps_mode_t mode, const char* password, cy_wps_credential_t* credentials, uint16_t* credential_length )
{
    cy_wps_workspace_t* host_workspace = (cy_wps_workspace_t*)workspace->wps_host_workspace;

    if( mode == CY_WPS_PBC_MODE )
    {
        workspace->password = "00000000";
    }
    else
    {
        workspace->password = password;
    }

    workspace->wps_mode = (cy_wps_mode_t) mode;

    if (workspace->agent_type == CY_WPS_ENROLLEE_AGENT)
    {
        host_workspace->stuff.enrollee.enrollee_output        = credentials;
        host_workspace->stuff.enrollee.enrollee_output_length = credential_length;
    }
    else
    {
        if (credentials == NULL)
        {
            return CY_RSLT_WPS_BADARG;
        }
        host_workspace->stuff.registrar.ap_details = credentials;
    }

    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_wps_wait_till_complete( cy_wps_agent_t* workspace )
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    if ( workspace->wps_result != CY_RSLT_WPS_NOT_STARTED )
    {
        cy_host_workspace_t* host_workspace = &((cy_wps_workspace_t*) workspace->wps_host_workspace)->host_workspace;
        result = cy_rtos_join_thread( &host_workspace->thread );
    }
    return result;
}

int cy_wps_get_stored_credential_count( cy_wps_agent_t* workspace )
{
    cy_wps_workspace_t* host = (cy_wps_workspace_t*) workspace->wps_host_workspace;
    return host->stuff.enrollee.stored_credential_count;
}

cy_rslt_t cy_wps_abort( cy_wps_agent_t* workspace )
{
    cy_host_workspace_t* host_workspace = &((cy_wps_workspace_t*) workspace->wps_host_workspace)->host_workspace;
    cy_event_message_t   message;
    message.event_type = CY_EVENT_ABORT_REQUESTED;
    message.data.value = 0;
    return (cy_rslt_t) cy_rtos_put_queue( &host_workspace->event_queue, &message, CY_RTOS_NEVER_TIMEOUT, false );
}


cy_rslt_t cy_wps_scan( cy_wps_agent_t* workspace, cy_wps_ap_t** ap_array, uint16_t* ap_array_size, whd_interface_t interface )
{
    cy_rslt_t          result;
    cy_event_message_t   message;
    cy_wps_workspace_t* host = (cy_wps_workspace_t*) workspace->wps_host_workspace;

    /* Verify that WPS hasn't started */
    if ( workspace->wps_result != CY_RSLT_WPS_NOT_STARTED )
    {
        return CY_RSLT_WPS_ERROR_ALREADY_STARTED;
    }

    IF_TO_WORKSPACE( interface ) = workspace;
    memset(host->stuff.enrollee.ap_list, 0, sizeof(host->stuff.enrollee.ap_list));
    cy_wps_host_scan( workspace, cy_wps_scan_result_handler, interface );

    do
    {
        result = cy_rtos_get_queue(&host->host_workspace.event_queue, &message, 5000, false);
    } while ( result == CY_RSLT_SUCCESS && message.event_type != CY_WPS_EVENT_DISCOVER_COMPLETE );

    IF_TO_WORKSPACE( interface ) = NULL;

    if ( result == CY_RSLT_SUCCESS )
    {
        *ap_array = host->stuff.enrollee.ap_list;
        *ap_array_size = host->stuff.enrollee.ap_list_counter;
    }

    return (cy_rslt_t) result;
}

void cy_wps_scan_result_handler( whd_scan_result_t* result, void* user_data )
{
    /* Process scan result */
    uint8_t                  keep_record = 0;
    cy_wps_agent_t*             workspace;
    uint8_t*                 data;
    uint32_t                 length;
    tlv8_data_t*             tlv8;
    cy_wps_uuid_t               uuid;
    cy_dsss_parameter_set_ie_t* dsie = NULL;
    cy_ht_operation_ie_t*       ht_operation_ie = NULL;

    uint16_t                 ie_offset;
    whd_scan_result_t*       bss_info;

    if ( ( result == NULL ) || ( user_data == NULL ) )
    {
        goto exit;
    }



    workspace = (cy_wps_agent_t*) user_data;
    bss_info = result;

    length = bss_info->ie_len;
    ie_offset = 0;

    data  =  (uint8_t*) bss_info->ie_ptr;

    do
    {
        if ( length == 0 )
        {
            break;
        }
        /* Scan result for vendor specific IE */
        tlv8 = tlv_find_tlv8( data, length, DOT11_IE_ID_VENDOR_SPECIFIC );
        if ( tlv8 == NULL )
        {
            break;
        }

        /* Check if the TLV we've found is outside the bounds of the scan result length. i.e. Something is bad */
        if (( (uint32_t)( (uint8_t*) tlv8 - data ) + tlv8->length + sizeof(tlv8_header_t)) > length)
        {
            goto exit;
        }

        length -= (uint32_t)( (uint8_t*) tlv8 - data ) + tlv8->length + sizeof(tlv8_header_t);
        data = (uint8_t*) tlv8 + tlv8->length + sizeof(tlv8_header_t);

        /* Verify extension is WPS extension */
        if ( memcmp( tlv8->data, WPS_OUI, 3 ) == 0 && tlv8->data[3] == WPS_OUI_TYPE )
        {
            tlv16_data_t* tlv16;

            /* Look for pwd ID */
            tlv16_uint16_t* pwd_id = (tlv16_uint16_t*) tlv_find_tlv16( &tlv8->data[4], (uint32_t)( tlv8->length - 4 ), WPS_ID_DEVICE_PWD_ID );
            if ( workspace->wps_mode == CY_WPS_PIN_MODE ||
                 ( pwd_id != NULL && cy_hton16( pwd_id->data ) == CY_WPS_PUSH_BTN_DEVICEPWDID ) ) /* XXX needs to change if NFC is in use */
            {
                keep_record = 1;

                /* Look for the AP's UUID */
                tlv16 = tlv_find_tlv16( &tlv8->data[4], (uint32_t)( tlv8->length - 4 ), WPS_ID_UUID_E );
                if ( ( tlv16 == NULL ) || ( cy_hton16(tlv16->length) != WPS_UUID_LENGTH ) )
                {
                    memset( &uuid, 0, sizeof( cy_wps_uuid_t ) );
                }
                else
                {
                    memcpy( &uuid, tlv16->data, sizeof( cy_wps_uuid_t ) );
                }

                /* Check if the Selected Registrar attribute is missing or false. Only applicable to PBC mode */
                if ( workspace->wps_mode == CY_WPS_PBC_MODE )
                {
                    /* Check if the registrar is using PBC mode */
                    if ( ( pwd_id != NULL && cy_hton16( pwd_id->data ) == CY_WPS_PUSH_BTN_DEVICEPWDID ) )
                    {
                        tlv16 = tlv_find_tlv16( &tlv8->data[4], (uint32_t)( tlv8->length - 4 ), WPS_ID_SEL_REGISTRAR );
                        if ( tlv16 != NULL )
                        {
                            /* Check that selected registrar is asserted */
                            if (tlv16->data[0] == 0)
                            {
                                keep_record = 0;
                            }
                        }
                        else
                        {
                            keep_record = 0;
                        }
                    }
                    else
                    {
                        keep_record = 0;
                    }
                }
            }
        }
    } while ( tlv8 != NULL );

    if ( keep_record == 1 )
    {
        /* Adjust the channel */
        data   = (uint8_t*) ( ( (uint8_t*) bss_info ) + ie_offset );
        uint32_t ie_len = result->ie_len;
        length = CY_WPS_HOST_READ_32((uint32_t *)&ie_len);
        /* In 2.4 GHz the radio firmware may report off channel probe responses. Parse the response to check if it is on or off the AP operating channel. */
        dsie =  (cy_dsss_parameter_set_ie_t*) cy_wps_parse_dot11_tlvs( (tlv8_header_t*)data, length, DOT11_IE_ID_DSSS_PARAMETER_SET );
        if ( ( dsie != NULL ) && ( dsie->length == DSSS_PARAMETER_SET_LENGTH ) )
        {
            result->channel = dsie->current_channel;
        }

        /* In 5GHz the DS Parameter Set element may not be present. If it's not present then for an 802.11a AP we use the channel from the chanspec, since
         * it will be a 20 MHz wide channel. If it's an 802.11n AP then we need to examine the HT operations element to find the primary 20 MHz channel
         * since the chanspec may report the center frequency if it's an 802.11n 40MHz or wider channel, which is not the same as the 20 MHz channel that the
         * beacons are on. */
        if ( ( dsie == NULL ) )
        {
            /* Find the primary channel */
            ht_operation_ie = (cy_ht_operation_ie_t*)cy_wps_parse_dot11_tlvs( (tlv8_header_t*)data, length, DOT11_IE_ID_HT_OPERATION );
            if ( ( ht_operation_ie != NULL ) && ( ht_operation_ie->length == HT_OPERATION_IE_LENGTH ) )
            {
                result->channel =  ht_operation_ie->primary_channel;
            }
        }

