Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/COMPONENT_WPS/cy_wps.c
        cy_wps_host_store_ap( workspace->wps_host_workspace, result, &uuid );
    }

exit:
    return;
}

cy_rslt_t cy_wps_set_directed_wps_target( cy_wps_agent_t* workspace, cy_wps_ap_t* ap, uint32_t maximum_join_attempts )
{
    workspace->directed_wps_max_attempts = maximum_join_attempts;
    workspace->ap = ap;

    return CY_RSLT_SUCCESS;
}

static cy_rslt_t cy_wps_internal_pbc_overlap_check( const whd_mac_t* mac )
{
    if ( cy_wps_pbc_overlap_check( mac ) != CY_RSLT_SUCCESS )
    {
        return CY_RSLT_WPS_PBC_OVERLAP;
    }
    return CY_RSLT_SUCCESS;
}

static void cy_wps_thread( cy_thread_arg_t arg )
{
    cy_wps_thread_main( arg );
    cy_rtos_exit_thread();
}

void cy_wps_thread_main( cy_thread_arg_t arg )
{
    cy_time_t             current_time;
    cy_rslt_t          result;
    cy_event_message_t  message;
    cy_wps_agent_t*          workspace = (cy_wps_agent_t*)arg;
    cy_wps_workspace_t* host      = (cy_wps_workspace_t*) workspace->wps_host_workspace;
    cy_rslt_t          wps_result;
    workspace->wps_result = CY_RSLT_WPS_IN_PROGRESS;

    /* Now that our queue is initialized we can flag the workspace as active */
    IF_TO_WORKSPACE( workspace->interface ) = workspace;


    cy_wps_prepare_workspace_crypto( workspace );

    /* Start 120 second timer */
    cy_rtos_get_time( &workspace->start_time );


    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Starting WPS Enrollee\r\n");
    cy_wps_enrollee_start( workspace, workspace->interface );

    while ( workspace->wps_result == CY_RSLT_WPS_IN_PROGRESS )
    {
        uint32_t     time_to_wait;
        bool         waiting_for_event = false;

        cy_rtos_get_time(&current_time);

        if (( current_time - workspace->start_time ) >= 2 * MINUTES )
        {
            workspace->wps_result = CY_RSLT_WPS_TIMEOUT;
            continue;
        }

        time_to_wait = ( 2 * MINUTES ) - ( current_time - workspace->start_time );
        if ( host->host_workspace.timer_timeout != 0 )
        {
            waiting_for_event = true;
            time_to_wait = MIN( time_to_wait, host->host_workspace.timer_timeout - (current_time - host->host_workspace.timer_reference));
        }

        if ( cy_rtos_get_queue( &host->host_workspace.event_queue, &message, time_to_wait, false ) != CY_RSLT_SUCCESS )
        {
            /* Create a timeout message */
            message.event_type = CY_EVENT_TIMER_TIMEOUT;
            message.data.value = 0;
        }

        /* Process the message */
        result = cy_wps_process_event( workspace, &message );
        if ( result != CY_RSLT_SUCCESS )
        {
            if ( result == CY_RSLT_WPS_ATTEMPTED_EXTERNAL_REGISTRAR_DISCOVERY )
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO,"Client attempted external registrar discovery\r\n");
            }
            else
            {
                if ( waiting_for_event == true )
                {
                    int32_t time_left;
                    cy_rtos_get_time( &current_time );
                    time_left = MAX( ( ( 2 * MINUTES ) - ( current_time - workspace->start_time ) )/1000, 0);
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "WPS Procedure failed. Restarting with %li seconds left\r\n", (long)time_left);
                    REFERENCE_DEBUG_ONLY_VARIABLE( time_left );
                }
            }

            /* Reset the agent type if we were in reverse registrar mode */
            if (workspace->in_reverse_registrar_mode != 0)
            {
                workspace->agent_type = CY_WPS_REGISTRAR_AGENT;
            }

            if ( workspace->agent_type == CY_WPS_ENROLLEE_AGENT )
            {
                whd_wifi_leave( workspace->interface );
            }

            cy_wps_reset_workspace( workspace, workspace->interface );
        }
    }

    /* Remove workspace from list of active workspaces */
    IF_TO_WORKSPACE( workspace->interface ) = NULL;

    /* Print result (if enabled) */
    if ( workspace->wps_result == CY_RSLT_WPS_COMPLETE )
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "WPS completed successfully\r\n");
    }
    else if ( workspace->wps_result == CY_RSLT_WPS_PBC_OVERLAP )
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "PBC overlap detected - wait and try again\r\n");
    }
    else if ( workspace->wps_result == CY_RSLT_WPS_ABORTED )
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "WPS aborted\r\n");
    }
    else
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "WPS timed out\r\n");
    }

    /* Indicate result via the callbacks */
    wps_result = workspace->wps_result; /* Need to make a copy because this thread can change the value before the application can check the result */
    if ( workspace->cy_wps_result_callback != NULL )
    {
        workspace->cy_wps_result_callback( &wps_result );
    }
    if ( workspace->cy_wps_internal_result_callback != NULL )
    {
        workspace->cy_wps_internal_result_callback( &wps_result );
    }

    
    /* De-init the workspace */
    cy_wps_deinit_workspace( workspace );
    whd_wifi_leave( workspace->interface );


    /* Clean up left over messages in the event queue */
    while ( cy_rtos_get_queue( &host->host_workspace.event_queue, &message, 0, false ) == CY_RSLT_SUCCESS )
    {
        if (message.event_type == CY_EVENT_EAPOL_PACKET_RECEIVED)
        {
            whd_buffer_release( workspace->interface->whd_driver, message.data.packet, WHD_NETWORK_RX);
        }
    }
}

static void cy_network_process_wps_eapol_data( /*@only@*/ whd_buffer_t buffer, whd_interface_t interface )
{
    cy_wps_agent_t* workspace = IF_TO_WORKSPACE( interface );
    if ( workspace != NULL )
    {
        /* Don't queue the packet unless the WPS thread is running */
        if( workspace->wps_result == CY_RSLT_WPS_IN_PROGRESS)
        {
            cy_host_workspace_t* host = &((cy_wps_workspace_t*) workspace->wps_host_workspace)->host_workspace;
            cy_event_message_t message;
            message.event_type = CY_EVENT_EAPOL_PACKET_RECEIVED;
            message.data.packet = buffer;
            if ( cy_rtos_put_queue( &host->event_queue, &message, 0, false ) != CY_RSLT_SUCCESS )
            {
                whd_buffer_release( workspace->interface->whd_driver, buffer, WHD_NETWORK_RX );
            }
        }
        else
        {
            whd_buffer_release( workspace->interface->whd_driver, buffer, WHD_NETWORK_RX );
        }
    }
    else
    {
        whd_buffer_release( interface->whd_driver, buffer, WHD_NETWORK_RX );
    }
}

int cy_wps_validate_pin_checksum( const char* str )
{
    unsigned long int PIN;
    unsigned long int accum = 0;

    PIN = (unsigned long int) atoi( str );

    accum += 3 * ((PIN / 10000000) % 10);
    accum += 1 * ((PIN / 1000000) % 10);
    accum += 3 * ((PIN / 100000) % 10);
    accum += 1 * ((PIN / 10000) % 10);
    accum += 3 * ((PIN / 1000) % 10);
    accum += 1 * ((PIN / 100) % 10);
    accum += 3 * ((PIN / 10) % 10);
    accum += 1 * ((PIN / 1) % 10);

    return (0 == (accum % 10));
}


/******************************************************
 *               WPS Host API Definitions
 ******************************************************/


