Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/COMPONENT_WPS/cy_wps.c
cy_rslt_t cy_wps_host_join( void* workspace, cy_wps_ap_t* ap, whd_interface_t interface )
{
    cy_host_workspace_t* host = &((cy_wps_workspace_t*) workspace)->host_workspace;

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Joining '%.*s'\r\n", ap->scan_result.SSID.length, ap->scan_result.SSID.value);

    uint8_t attempts = 0;
    cy_rslt_t ret;

    do
    {
        ++attempts;
        ret = (cy_rslt_t) whd_wifi_join_specific(interface, &ap->scan_result, NULL, 0 );
        if (ret != CY_RSLT_SUCCESS)
        {
            continue;
        }
    } while ( ret != CY_RSLT_SUCCESS && attempts < 2 );

    if ( ret != CY_RSLT_SUCCESS )
    {
        if ( whd_wifi_is_ready_to_transceive( interface ) != WHD_SUCCESS )
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WPS join failed on interface %u\r\n", (unsigned int)interface);
            cy_host_start_timer( host, 100 );
            return CY_RSLT_WPS_ERROR_JOIN_FAILED;
        }
    }

    cy_event_message_t message;
    message.event_type = CY_WPS_EVENT_ENROLLEE_ASSOCIATED;
    message.data.value = 0;
    cy_rtos_put_queue(&host->event_queue, &message, 0, false);

    return CY_RSLT_SUCCESS;
}

void cy_wps_host_add_vendor_ie( uint32_t interface, void* data, uint16_t data_length, uint32_t packet_mask )
{
    whd_wifi_manage_custom_ie( ( whd_interface_t )interface, WHD_ADD_CUSTOM_IE, (uint8_t*) WPS_OUI, WPS_OUI_TYPE, data, data_length, packet_mask );
}

void cy_wps_host_remove_vendor_ie( uint32_t interface, void* data, uint16_t data_length, uint32_t packet_mask )
{
    whd_wifi_manage_custom_ie( ( whd_interface_t )interface, WHD_REMOVE_CUSTOM_IE, (uint8_t*) WPS_OUI, WPS_OUI_TYPE, data, data_length, packet_mask );
}

/*
 * NOTE: This function is called from the context of the WICED thread and so should not consume
 *       much stack space and must not printf().
 */
cy_wps_ap_t* cy_wps_host_store_ap( void* workspace, whd_scan_result_t* scan_result, cy_wps_uuid_t* uuid )
{
    cy_wps_workspace_t* host = (cy_wps_workspace_t*)workspace;

    if (host->stuff.enrollee.ap_list_counter < AP_LIST_SIZE)
    {
        int a;
        cy_wps_ap_t* ap;

        /* Check if this AP has already been added */
        for (a = 0; a < host->stuff.enrollee.ap_list_counter; ++a)
        {
            ap = &host->stuff.enrollee.ap_list[a];
            if (memcmp(&ap->scan_result.BSSID, &scan_result->BSSID, sizeof(whd_mac_t)) == 0)
            {
                return NULL;
            }
        }

        /* Add to AP list */
        ap = &host->stuff.enrollee.ap_list[host->stuff.enrollee.ap_list_counter++];

        /* Save SSID, BSSID, channel, security, band and UUID */
        ap->scan_result.SSID.length = scan_result->SSID.length;
        memcpy( ap->scan_result.SSID.value, scan_result->SSID.value, scan_result->SSID.length );
        memcpy( &ap->scan_result.BSSID, &scan_result->BSSID, sizeof(ap->scan_result.BSSID) );
        ap->scan_result.channel  = scan_result->channel;
        if( scan_result->security == WHD_SECURITY_OPEN )
        {
            ap->scan_result.security = WHD_SECURITY_OPEN;
        }
        else
        {
            ap->scan_result.security = WHD_SECURITY_WPS_SECURE;
        }
        ap->scan_result.band     = scan_result->band;
        memcpy( &ap->uuid, uuid, sizeof( cy_wps_uuid_t ) );

        return ap;
    }

    return NULL;
}

cy_rslt_t cy_wps_enrollee_pbc_overlap_check( cy_wps_agent_t* workspace )
{
    cy_wps_workspace_t* host = (cy_wps_workspace_t*)workspace->wps_host_workspace;
    uint16_t ap_list_size;

    ap_list_size = cy_wps_host_get_ap_list_size( workspace->wps_host_workspace );
    if ( ap_list_size > 1 )
    {
        /* If the enrollee only supports one band then PBC overlap is occurring if the AP list is > 1 */
        if ( workspace->band_list.number_of_bands < 2 )
        {
            return CY_RSLT_WPS_PBC_OVERLAP;
        }
        /* If the enrollee supports two bands and the AP list size is two then check if the
         * AP is dual band by checking that the UUIDs in the AP entries are the same.
         */
        if ( ap_list_size == 2)
        {
            if (memcmp( &host->stuff.enrollee.ap_list[0].uuid, &host->stuff.enrollee.ap_list[1].uuid, sizeof( cy_wps_uuid_t ) ) == 0)
            {
                return CY_RSLT_SUCCESS;
            }
        }
    }
    else
    {
        return CY_RSLT_SUCCESS;
    }

    return CY_RSLT_WPS_PBC_OVERLAP;
}


cy_wps_ap_t* cy_wps_host_retrieve_ap( void* workspace )
{
    cy_wps_workspace_t* host = (cy_wps_workspace_t*)workspace;
    if ( host->stuff.enrollee.ap_list_counter != 0 )
    {
        return &host->stuff.enrollee.ap_list[--host->stuff.enrollee.ap_list_counter];
    }

    return NULL;
}

uint16_t cy_wps_host_get_ap_list_size( void* workspace )
{
    cy_wps_workspace_t* host = (cy_wps_workspace_t*)workspace;
    return host->stuff.enrollee.ap_list_counter;
}

void cy_wps_host_store_credential( void* workspace, cy_wps_internal_credential_t* credential )
{
    cy_wps_workspace_t* host = (cy_wps_workspace_t*)workspace;
    cy_wps_credential_t* temp;
    uint8_t credential_length = 0, ssid_length = 0;

    /* Store credentials if we have room */
    if ( host->stuff.enrollee.stored_credential_count < *(host->stuff.enrollee.enrollee_output_length))
    {
        temp = &host->stuff.enrollee.enrollee_output[host->stuff.enrollee.stored_credential_count];
        memset( temp, 0, sizeof(cy_wps_credential_t) );

        /* Copy only CY_WPS_PASSPHRASE_LENGTH when credential->network_key_length is greater than CY_WPS_PASSPHRASE_LENGTH */
        credential_length = (credential->network_key_length > CY_WPS_PASSPHRASE_LENGTH) ? CY_WPS_PASSPHRASE_LENGTH : credential->network_key_length;
        memcpy( temp->passphrase, credential->network_key, credential_length );
        temp->passphrase[credential_length] = 0;

        /* Copy only CY_WPS_SSID_LENGTH when credential->ssid_length is greater than CY_WPS_SSID_LENGTH */
        ssid_length = (credential->ssid_length > CY_WPS_SSID_LENGTH) ? CY_WPS_SSID_LENGTH : credential->ssid_length;
        memcpy( temp->ssid, credential->ssid, ssid_length );
        temp->ssid[ssid_length] = 0;

