Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/COMPONENT_WPS/cy_wps.c
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO,"Storing credentials for %s\r\n", temp->ssid);
        switch ( credential->encryption_type )
        {
            case CY_WPS_MIXED_ENCRYPTION:
            case CY_WPS_AES_ENCRYPTION:
                if ( credential->authentication_type == CY_WPS_WPA2_PSK_AUTHENTICATION )
                {
                    temp->security = WHD_SECURITY_WPA2_AES_PSK;
                }
                else if ( credential->authentication_type == CY_WPS_WPA_PSK_AUTHENTICATION )
                {
                    temp->security = WHD_SECURITY_WPA_AES_PSK;
                }
                else
                {
                    temp->security = WHD_SECURITY_WPA2_MIXED_PSK;
                }
                break;
            case CY_WPS_TKIP_ENCRYPTION:
                if ( ( credential->authentication_type == CY_WPS_WPA2_PSK_AUTHENTICATION ) ||
                     ( credential->authentication_type == CY_WPS_WPA2_WPA_PSK_MIXED_AUTHENTICATION ) )
                {
                    temp->security = WHD_SECURITY_WPA2_TKIP_PSK;
                }
                else if ( credential->authentication_type == CY_WPS_WPA_PSK_AUTHENTICATION )
                {
                    temp->security = WHD_SECURITY_WPA_TKIP_PSK;
                }
                break;
            case CY_WPS_WEP_ENCRYPTION:
                temp->security = WHD_SECURITY_WEP_PSK;
                break;
            case CY_WPS_NO_ENCRYPTION:
            default:
                temp->security = WHD_SECURITY_OPEN;
                break;
        }

        ++host->stuff.enrollee.stored_credential_count;
    }
}

void cy_wps_host_retrieve_credential( void* workspace, cy_wps_internal_credential_t* credential )
{
    cy_wps_workspace_t*  host       = (cy_wps_workspace_t*) workspace;
    const cy_wps_credential_t* ap_details = host->stuff.registrar.ap_details;

    memcpy( credential->ssid, ap_details->ssid, sizeof( credential->ssid ) );
    credential->network_key_length = (uint8_t)strlen((char*)ap_details->passphrase);
    memcpy( credential->network_key, ap_details->passphrase, sizeof( credential->network_key ) );

    switch ( ap_details->security )
    {
        default:
        case WHD_SECURITY_OPEN:
            credential->encryption_type     = CY_WPS_NO_ENCRYPTION;
            credential->authentication_type = CY_WPS_OPEN_AUTHENTICATION;
            break;
        case WHD_SECURITY_WEP_PSK:
            credential->encryption_type     = CY_WPS_WEP_ENCRYPTION;
            credential->authentication_type = CY_WPS_OPEN_AUTHENTICATION;
            break;
        case WHD_SECURITY_WPA_TKIP_PSK:
            credential->encryption_type     = CY_WPS_TKIP_ENCRYPTION;
            credential->authentication_type = CY_WPS_WPA_PSK_AUTHENTICATION;
            break;
        case WHD_SECURITY_WPA_AES_PSK:
            credential->encryption_type     = CY_WPS_AES_ENCRYPTION;
            credential->authentication_type = CY_WPS_WPA_PSK_AUTHENTICATION;
            break;
        case WHD_SECURITY_WPA2_AES_PSK:
            credential->encryption_type     = CY_WPS_AES_ENCRYPTION;
            credential->authentication_type = CY_WPS_WPA2_PSK_AUTHENTICATION;
            break;
        case WHD_SECURITY_WPA2_TKIP_PSK:
            credential->encryption_type     = CY_WPS_TKIP_ENCRYPTION;
            credential->authentication_type = CY_WPS_WPA2_PSK_AUTHENTICATION;
            break;
        case WHD_SECURITY_WPA2_MIXED_PSK:
            credential->encryption_type     = CY_WPS_MIXED_ENCRYPTION;
            credential->authentication_type = CY_WPS_WPA2_PSK_AUTHENTICATION;
            break;
    }
}

static void cy_wps_whd_scan_result_handler( whd_scan_result_t** result_ptr, void* user_data, whd_scan_status_t status )
{
    uint8_t a;

    /* Verify the workspace is still valid */
    for ( a = 0; a < ACTIVE_WPS_WORKSPACE_ARRAY_SIZE; ++a )
    {
        if (active_wps_workspaces[a] == user_data)
        {
            /* Get the host workspace now that we know the workspace is still valid */
            cy_wps_workspace_t* host = (cy_wps_workspace_t*) ( (cy_wps_agent_t*) ( user_data ) )->wps_host_workspace;

            /* Check if scan is complete */
            if ( result_ptr == NULL )
            {
                cy_event_message_t message;
                message.event_type = CY_WPS_EVENT_DISCOVER_COMPLETE;
                message.data.value = 0;
                cy_rtos_put_queue( &host->host_workspace.event_queue, &message, 0, false );
            }
            else if ( status == WHD_SCAN_INCOMPLETE )
            {
                host->stuff.enrollee.scan_handler_ptr( *result_ptr, user_data );
            }

            break;
        }
    }
}

void cy_wps_host_scan( cy_wps_agent_t* workspace, cy_wps_scan_handler_t result_handler, whd_interface_t interface )
{
    whd_buffer_t buffer;
    whd_buffer_t response;
    cy_wps_workspace_t* host = (cy_wps_workspace_t*) (workspace->wps_host_workspace);
    host->stuff.enrollee.ap_list_counter  = 0;
    host->stuff.enrollee.scan_handler_ptr = result_handler;
    uint8_t attempts = 0;
    cy_rslt_t ret;
    uint16_t chlist[] = { 1,2,3,4,5,6,7,8,9,10,11,12,13,14,0 };
    whd_scan_extended_params_t extparam = { 2, 40, 110, 50 };
    uint32_t scan_timeout = DUAL_BAND_WPS_SCAN_TIMEOUT; /* Default scan timeout to cover scans of both 2.4GHz and 5 GHz bands */

    /* Check if only one band is supported and adjust the scan timeout accordingly. Note that if the scan timeout is shorter than the time required to scan
     * all the channels then the WPS enrollee will go into a scan request/abort loop which causes various problems including lockup for SPI builds. */
    memset( &workspace->band_list, 0, sizeof( whd_band_list_t ) );

    whd_cdc_get_ioctl_buffer(host->host_workspace.interface->whd_driver, &buffer, sizeof(whd_band_list_t) );

    whd_cdc_send_ioctl(host->host_workspace.interface,  CDC_GET, WLC_GET_BANDLIST, buffer, &response);

    memcpy(&workspace->band_list, (uint32_t*) whd_buffer_get_current_piece_data_pointer(host->host_workspace.interface->whd_driver, response), sizeof(whd_band_list_t));
    whd_buffer_release(host->host_workspace.interface->whd_driver, response, WHD_NETWORK_RX);

    if ( workspace->band_list.number_of_bands == 1 )
    {
        if ( workspace->band_list.number_of_bands == 1 )
        {
            scan_timeout = SINGLE_BAND_WPS_SCAN_TIMEOUT;
        }
    }
    memset(&scan_result, 0, sizeof(whd_scan_result_t) );

    do
    {
        ++attempts;
        ret = (cy_rslt_t) whd_wifi_scan(interface, WHD_SCAN_TYPE_ACTIVE, WHD_BSS_TYPE_INFRASTRUCTURE, 0, 0, chlist, &extparam, cy_wps_whd_scan_result_handler, &scan_result, workspace);
    } while ( ret != CY_RSLT_SUCCESS && attempts < 5 );

    if (ret != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "WPS scan failure\r\n");
        cy_host_start_timer( host, 100 );
    }
    else
    {
        cy_host_start_timer( host, scan_timeout );
    }
}

void cy_wps_host_get_authorized_macs( void* workspace, whd_mac_t** mac_list, uint8_t* mac_list_length )
{
    cy_wps_workspace_t* host = (cy_wps_workspace_t*)workspace;
    *mac_list = &host->stuff.registrar.authorized_mac_list[0];
    *mac_list_length = 1;
}

static void* cy_wps_softap_event_handler( whd_interface_t interface, const whd_event_header_t* event_header, const uint8_t* event_data, /*@returned@*/ void* handler_user_data )
{
    const uint8_t* data;
    uint32_t       length;
    tlv8_data_t*   tlv8;
    cy_wps_agent_t*   workspace;

    if ( ( event_header == NULL ) || ( event_data == NULL ) || ( handler_user_data == NULL ) )
    {
        return handler_user_data;
    }
    workspace = (cy_wps_agent_t*)handler_user_data;
    length    = event_header->datalen;

    if ( ( length <= 24 ) || ( workspace == NULL ) )
    {
        return handler_user_data;
    }
    length -= 24; /* XXX length of management frame MAC header */
    data = event_data + 24;

