Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/COMPONENT_WPS/cy_wps.c
    switch ( event_header->event_type )
    {
        case WLC_E_PROBREQ_MSG:
            if ( event_header->status == WLC_E_STATUS_SUCCESS )
            {
                do
                {
                    /* Scan result for vendor specific IE */
                    tlv8 = tlv_find_tlv8( data, length, DOT11_IE_ID_VENDOR_SPECIFIC );
                    if ( tlv8 == NULL )
                    {
                        break;
                    }
                    /* Check if the TLV we've found is outside the bounds of the scan result length. i.e. Something is bad */
                    if ((( (uint8_t*) tlv8 - data ) + tlv8->length + sizeof(tlv8_header_t)) > length)
                    {
                        break;
                    }

                    length -= ( (uint8_t*) tlv8 - data ) + tlv8->length + sizeof(tlv8_header_t);
                    data = (uint8_t*) tlv8 + tlv8->length + sizeof(tlv8_header_t);

                    /* Verify extension is WPS extension */
                    if ( memcmp( tlv8->data, WPS_OUI, 3 ) == 0 && tlv8->data[3] == WPS_OUI_TYPE )
                    {
                        /* Look for pwd ID, check if it is the same mode that we are */
                        tlv16_uint16_t* pwd_id = (tlv16_uint16_t*) tlv_find_tlv16( &tlv8->data[4], tlv8->length - 4, WPS_ID_DEVICE_PWD_ID );
                        if ( pwd_id != NULL && cy_hton16( pwd_id->data ) == CY_WPS_PUSH_BTN_DEVICEPWDID )
                        {
                            cy_wps_update_pbc_overlap_array( workspace, (whd_mac_t*)(event_data + 10) );
                        }
                    }
                } while ( ( tlv8 != NULL ) && ( length > 0 ) );
            }
            break;

        default:
            break;
    }

    return handler_user_data;
}

/* Note that this function may be called from the Wiced thread context */
void cy_wps_update_pbc_overlap_array(cy_wps_agent_t* workspace, const whd_mac_t* mac_address )
{
    int i;
    cy_time_t              rx_time;
    cy_event_message_t   message;
    cy_host_workspace_t* host = &((cy_wps_workspace_t*)workspace->wps_host_workspace)->host_workspace;
    whd_mac_t             mac;

    cy_rtos_get_time(&rx_time);
    memcpy( &mac, mac_address, sizeof( whd_mac_t ) );

    /* If the MAC address is the same as the last enrollee give it 5 seconds to stop asserting PBC mode */
    if ( ( memcmp( &mac, (char*) &last_pbc_enrollee.probe_request_mac, sizeof(whd_mac_t) ) == 0 ) &&
         ( ( rx_time - last_pbc_enrollee.probe_request_rx_time ) <= WPS_PBC_MODE_ASSERTION_DELAY ) )
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Received probe request asserting PBC mode from last enrollee\r\n");
        goto return_without_notify;
    }

    /* If the MAC address is already in the array update the rx time */
    for ( i = 0; i < 2; i++ )
    {
        if (memcmp(&mac, (char*)&pbc_overlap_array[i].probe_request_mac, sizeof(whd_mac_t)) == 0)
        {
            /* Notify the application that a probe request has been received, but only do this every few seconds. */
            if ( ( rx_time - pbc_overlap_array[i].probe_request_rx_time ) <= WPS_PBC_NOTIFICATION_DELAY )
            {
                pbc_overlap_array[i].probe_request_rx_time = rx_time;
                goto return_without_notify;
            }
            else
            {
                pbc_overlap_array[i].probe_request_rx_time = rx_time;
                goto return_with_notify;
            }
        }
    }

    /* If this is a new MAC address replace oldest existing entry with this MAC address */
    if ( pbc_overlap_array[0].probe_request_rx_time == 0 ) /* Initial condition for array record 0 */
    {
        memcpy((char*)&pbc_overlap_array[0].probe_request_mac, &mac, sizeof(whd_mac_t));
        pbc_overlap_array[0].probe_request_rx_time = rx_time;
    }
    else if ( pbc_overlap_array[1].probe_request_rx_time == 0 ) /* Initial condition for array record 1 */
    {
        memcpy((char*)&pbc_overlap_array[1].probe_request_mac, &mac, sizeof(whd_mac_t));
        pbc_overlap_array[1].probe_request_rx_time = rx_time;
    }
    else if ( pbc_overlap_array[0].probe_request_rx_time <= pbc_overlap_array[1].probe_request_rx_time )
    {
        memcpy((char*)&pbc_overlap_array[0].probe_request_mac, &mac, sizeof(whd_mac_t));
        pbc_overlap_array[0].probe_request_rx_time = rx_time;
    }
    else
    {
        memcpy((char*)&pbc_overlap_array[1].probe_request_mac, &mac, sizeof(whd_mac_t));
    }

return_with_notify:
    /* This event is only so that the user of the SoftAP (not group owner) can be notified of PBC overlap during the Registrar WPS handshake.
     * If the event queue is full we can safely skip this event so the wait time is zero.
     */
    if ( ( workspace->is_p2p_enrollee == 0 ) && ( workspace->is_p2p_registrar == 0 ) &&
            ( workspace->wps_result == CY_RSLT_WPS_IN_PROGRESS ) && ( workspace->agent_type == CY_WPS_REGISTRAR_AGENT ) &&
            ( workspace->wps_mode == CY_WPS_PBC_MODE ))
    {
        message.event_type  = CY_WPS_EVENT_PBC_OVERLAP_NOTIFY_USER;
        message.data.packet = &mac;
        if (cy_rtos_put_queue(&host->event_queue, &message, 0, false) != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "No room in the WPS event queue\r\n");
        }
    }

return_without_notify:
    return;
}

void wps_register_pbc_probreq_callback( cy_wps_pbc_probreq_notify_callback_t pbc_probreq_callback )
{
    pbc_probreq_notify_callback = pbc_probreq_callback;
}

void cy_wps_pbc_overlap_array_notify( const whd_mac_t* mac )
{
    if ( pbc_probreq_notify_callback != NULL )
    {
        whd_mac_t probreq_mac;
        memcpy(&probreq_mac, mac, sizeof(whd_mac_t));
        pbc_probreq_notify_callback(probreq_mac);
    }
}

void cy_wps_clear_pbc_overlap_array( void )
{
    memset( (char*)pbc_overlap_array, 0, sizeof(pbc_overlap_array) );
}

cy_rslt_t cy_wps_pbc_overlap_check(const whd_mac_t* mac )
{
    cy_time_t detection_window_start;
    cy_time_t time_now;

    /* Detection window starts at 0, or 120 seconds prior to now if the host has been up for more than 120 seconds */
    detection_window_start = 0;
    cy_rtos_get_time(&time_now);
    if ( time_now > WPS_PBC_OVERLAP_WINDOW )
    {
        detection_window_start = time_now - WPS_PBC_OVERLAP_WINDOW;
    }

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "PBC overlap detection window start %u\r\n", (unsigned int)detection_window_start);

    /* This tests the case where M1 has arrived and there may or may not be a probe request from the same enrollee
     * in the detection array, but there is a probe request from another enrollee.
     */
    if ( mac != NULL )
    {
        if ( ( memcmp( mac, (char*) &pbc_overlap_array[0].probe_request_mac, sizeof(whd_mac_t) ) != 0 ) &&
             ( pbc_overlap_array[0].probe_request_rx_time > detection_window_start ) )
        {
            return CY_RSLT_WPS_PBC_OVERLAP;
        }

        if ( ( memcmp( mac, (char*) &pbc_overlap_array[1].probe_request_mac, sizeof(whd_mac_t) ) != 0 ) &&
             ( pbc_overlap_array[1].probe_request_rx_time > detection_window_start ) )
        {
            return CY_RSLT_WPS_PBC_OVERLAP;
        }
        else
        {
            return CY_RSLT_SUCCESS;
        }
    }
    else
    {
        /* This tests the simple case where two enrollees have been probing during the detection window */
        if ( ( pbc_overlap_array[0].probe_request_rx_time > detection_window_start ) &&
             ( pbc_overlap_array[1].probe_request_rx_time > detection_window_start ) )
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "PBC overlap array entry 0 %u\r\n", (unsigned int)pbc_overlap_array[0].probe_request_rx_time);
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "PBC overlap array entry 1 %u\r\n", (unsigned int)pbc_overlap_array[1].probe_request_rx_time);
            return CY_RSLT_WPS_PBC_OVERLAP;
        }
    }

    return CY_RSLT_SUCCESS;
}

void cy_wps_record_last_pbc_enrollee( const whd_mac_t* mac )
{
    memcpy((char*)&last_pbc_enrollee.probe_request_mac, mac, sizeof(whd_mac_t));
    cy_rtos_get_time( &last_pbc_enrollee.probe_request_rx_time );
}

void cy_wps_register_result_callback( cy_wps_agent_t* workspace, void (*wps_result_callback)(cy_rslt_t*) )
{
    workspace->cy_wps_result_callback = wps_result_callback;
}

void cy_wps_register_internal_result_callback( cy_wps_agent_t* workspace, void (*wps_internal_result_callback)(cy_rslt_t*) )
{
    workspace->cy_wps_internal_result_callback = wps_internal_result_callback;
}

/* Note that there is an identical function in wwd_wifi.c which can't be used currently because making it non-static causes build errors related to the tlv8 structs. */
static tlv8_header_t* cy_wps_parse_dot11_tlvs( const tlv8_header_t* tlv_buf, uint32_t buflen, dot11_ie_id_t key )
{

    return (tlv8_header_t*) tlv_find_tlv8( (const uint8_t*) tlv_buf, buflen, key );
}
